###############################################1
value = 101 #value = int()

new_value = value / 2 if value < 100 else -value
print(new_value)
###############################################2
value=10 #value = int()

new_value = 1 if value < 100 else 0
print(new_value)
########################################################

#3) У вас є змінна величина, тип - int. Напишіть тернарний оператор для змінного new_value за таким правилом: якщо
 #   значення менше 100, то new_value дорівнює True, у протилежному випадку - False

########################################################

#4) У вас є змінна my_str, тип - str. Якщо її довше менше 5, то допишіть в кінці строки її ж.
  #  Приклад: було - "qwer", стало - "qwerqwer". Якщо довжина не менше 5, то залишити строку як є.

########################################################

#5) У вас є змінна my_str, тип - str. Якщо її довжина менше 5, то допишіть в кінці рядка перевернуту її ж.
  #  Приклад: було - "qwer", стало - "qwerrewq". Якщо довжина не менше 5, то залишити строку як є.



